howto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>How to Build Emacs on Windows</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="How to Build Emacs on Windows"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-04T19:16-0700"/>
<meta name="author" content="Hideki Saito"/>
<meta name="description" content="Explaining how to build Emacs on Windows"/>
<meta name="keywords" content="Emacs, software, OSS, compile, build, Windows "/>
<link rel="stylesheet" type="text/css" href="style.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">How to Build Emacs on Windows</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Getting files</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Source</h3>
<div class="outline-text-3" id="text-1-1">

<p>Get the tarball from <a href="http://www.gnu.org/software/emacs/">GNU Emacs</a> page.
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Build Tools</h3>
<div class="outline-text-3" id="text-1-2">

<p>You will need some build tools. <a href="http://www.mingw.org/">MinGW</a> provides tools you need in order to compile Emacs. Specifically, you need <b>make</b> and <b>gcc</b> tools from MinGW.
</p>
<p>
The <b>makeinfo</b> tool from <a href="http://gnuwin32.sourceforge.net/packages/texinfo.htm">TexInfo</a> is also required.<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>
</p>
<p>
The <a href="http://gnuwin32.sourceforge.net/packages/coreutils.htm">CoreUtils</a> provides many of required tools, so install it, too.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Dependencies</h3>
<div class="outline-text-3" id="text-1-3">

<p>In addition, you may want to install the following dependencies. Using setup application is far easier way of handling this.
</p><ul>
<li><a href="http://gnuwin32.sourceforge.net/packages/libpng.htm">LibPng</a>
</li>
<li><a href="http://gnuwin32.sourceforge.net/packages/jpeg.htm">Jpeg</a>
</li>
<li><a href="http://gnuwin32.sourceforge.net/packages/giflib.htm">GIfLib</a>
</li>
<li><a href="http://gnuwin32.sourceforge.net/packages/tiff.htm">Tiff</a>
</li>
<li><a href="http://www.zlatkovic.com/libxml.en.html">LibXml</a>
</li>
<li><a href="http://www.gnutls.org/">GnuTLS</a>
</li>
<li><a href="http://gnuwin32.sourceforge.net/packages/xpm.htm">XPM</a>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Compile Procedures</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Configuring</h3>
<div class="outline-text-3" id="text-2-1">

<p>First, go to <i>nt</i> directory within the uncompressed Emacs source file.
</p>
<p>
Before proceeding, temporarily turn off your malware scanners. Yes, I meant it. Some of stricter malware scanners cause false alarm while building Emacs and can cause the build process to fail. 
</p>
<p>
Issue the following command where <i>path-to-dependency-includes</i> being place of your includes (*.h) files. 
</p><blockquote>

<p><code>configure.bat --with-gcc --cflags -I /path-to-dependency-includes/</code>
</p>
</blockquote>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Build</h3>
<div class="outline-text-3" id="text-2-2">

<p>The following command will make the build
</p>

<blockquote>

<p><code>make</code>
</p>
</blockquote>


<p>
The following command will then make distribution file.<sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup> I found it easier to just make dist file first then issuing <i>make install</i> &ndash; this way, you can install your Emacs distribution to any places of your choice.
</p>

<blockquote>

<p><code>make dist</code>
</p>
</blockquote>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Other Information</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><a href="http://ourcomments.org/Emacs/w32-build-emacs.html">Building Emacs on MS Windows</a>, although based on the older Emacs distributions, many of parts are still pertinent.
</li>
<li>The <i>INSTALL</i> file within <i>nt</i> directory inside Emacs source titled <i>Building and Installing Emacs on Windows (from 95 to 7 and beyond)</i> explains details about building process.
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> I found that the latest version of TexInfo crashes while processing Emacs files &ndash; you may want <a href="http://sourceforge.net/projects/gnuwin32/files/texinfo/4.8/">4.8</a> instead.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.2" href="#fnr-.2">2</a></sup> You will need <i>7z.exe</i> in the path to this to work.
</p></div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-04T19:16-0700</p>
<p class="author">Author: Hideki Saito</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.4 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
